interview/question/shubhi/interview_question.org
#+BEGIN_HTML
<link rel="stylesheet" type="text/css" href="tstyles.css" /><link rel="stylesheet" type="text/css" media="print" href="print.css" />
<link type="text/css" rel="stylesheet" href="sh_style.css" /></head>
#+END_HTML

#+title: Shubhi's Interview in Cognizent

* What the following means ?
** myclass a;                      
   - a is an instance of a class.
** myclass a (myclass &b);
   - copy constructor
** myclass b ();
   - function declaration . 
** myclass b = a;
   - copy constructor

* write a copy construction. 
  Member variable :
  1) pointer 
  2) data on stack

* Can Constructor be virtual ?
* Can destructor can throw exception ?
* What are the different ways to remove constness?
* Why const reference is passed in copyconstructor?
* Diferent types of casting?
** What is ~static_cast~ ?
* How to create thread?
* How to make thread detachable?
* What happen to child threads when main returns?
* Synchronization primitive.
* If there is core dump in the production box how you will debug your program ?  



