interview/question/shubhi/interview_question.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Shubhi's Interview in Cognizent</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-01 02:18:26 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Shubhi's Interview in Cognizent</h1>


<link rel="stylesheet" type="text/css" href="tstyles.css" /><link rel="stylesheet" type="text/css" media="print" href="print.css" />
<link type="text/css" rel="stylesheet" href="sh_style.css" /></head>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 What the following means ? </a>
<ul>
<li><a href="#sec-1_1">1.1 myclass a; </a></li>
<li><a href="#sec-1_2">1.2 myclass a (myclass &amp;b); </a></li>
<li><a href="#sec-1_3">1.3 myclass b (); </a></li>
<li><a href="#sec-1_4">1.4 myclass b = a; </a></li>
</ul>
</li>
<li><a href="#sec-2">2 write a copy construction. </a></li>
<li><a href="#sec-3">3 Can Constructor be virtual ? </a></li>
<li><a href="#sec-4">4 Can destructor can throw exception ? </a></li>
<li><a href="#sec-5">5 What are the different ways to remove constness? </a></li>
<li><a href="#sec-6">6 Why const reference is passed in copyconstructor? </a></li>
<li><a href="#sec-7">7 Diferent types of casting? </a>
<ul>
<li><a href="#sec-7_1">7.1 What is <code>static_cast</code> ? </a></li>
</ul>
</li>
<li><a href="#sec-8">8 How to create thread? </a></li>
<li><a href="#sec-9">9 How to make thread detachable? </a></li>
<li><a href="#sec-10">10 What happen to child threads when main returns? </a></li>
<li><a href="#sec-11">11 Synchronization primitive. </a></li>
<li><a href="#sec-12">12 If there is core dump in the production box how you will debug your program ? </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What the following means ? </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> myclass a; </h3>
<div class="outline-text-3" id="text-1_1">

<ul>
<li>
a is an instance of a class.
</li>
</ul>
</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> myclass a (myclass &amp;b); </h3>
<div class="outline-text-3" id="text-1_2">

<ul>
<li>
copy constructor
</li>
</ul>
</div>

</div>

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3"><span class="section-number-3">1.3</span> myclass b (); </h3>
<div class="outline-text-3" id="text-1_3">

<ul>
<li>
function declaration . 
</li>
</ul>
</div>

</div>

<div id="outline-container-1_4" class="outline-3">
<h3 id="sec-1_4"><span class="section-number-3">1.4</span> myclass b = a; </h3>
<div class="outline-text-3" id="text-1_4">

<ul>
<li>
copy constructor

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> write a copy construction. </h2>
<div class="outline-text-2" id="text-2">

<p>Member variable :
</p><ol>
<li>
pointer 
</li>
<li>
data on stack

</li>
</ol>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Can Constructor be virtual ? </h2>
<div class="outline-text-2" id="text-3">

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Can destructor can throw exception ? </h2>
<div class="outline-text-2" id="text-4">

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> What are the different ways to remove constness? </h2>
<div class="outline-text-2" id="text-5">

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Why const reference is passed in copyconstructor? </h2>
<div class="outline-text-2" id="text-6">

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Diferent types of casting? </h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7_1" class="outline-3">
<h3 id="sec-7_1"><span class="section-number-3">7.1</span> What is <code>static_cast</code> ? </h3>
<div class="outline-text-3" id="text-7_1">

</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> How to create thread? </h2>
<div class="outline-text-2" id="text-8">

</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> How to make thread detachable? </h2>
<div class="outline-text-2" id="text-9">

</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> What happen to child threads when main returns? </h2>
<div class="outline-text-2" id="text-10">

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Synchronization primitive. </h2>
<div class="outline-text-2" id="text-11">

</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> If there is core dump in the production box how you will debug your program ? </h2>
<div class="outline-text-2" id="text-12">




</div>
</div>
<div id="postamble">
<p class="author"> Author: 
</p>
<p class="date"> Date: 2014-01-01 02:18:26 </p>
<p class="creator">HTML generated by org-mode 7.01 in emacs 24</p>
</div>
</div>
</body>
</html>
